import 'package:searchtosu/models/quran_ayat_models.dart';

class AddQuranSuraDetails{

  List<QuranAyatModels> _quranAyatModels=[

    QuranAyatModels(	104,"	 بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ ﴿۱﴾ 	","বিছমিল্লাহির রাহমানির রাহিম।","	শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।	",0	),
    QuranAyatModels(	104,"	وَیۡلٌ لِّکُلِّ ہُمَزَۃٍ لُّمَزَۃِۣ ۙ﴿۱﴾	","ওয়াইলুলিলকুল্লি হুমাঝাতিল লুমাঝাহ ।","	১) ধবংশ এমন প্রত্যেক ব্যক্তির জন্য যে (সামনা সামনি) লোকদের ধিক্কার দেয় এবং (পেছনে ) নিন্দা করতে অভ্যস্ত  ৷	",1	),
    QuranAyatModels(	104,"	الَّذِیۡ جَمَعَ مَالًا وَّ عَدَّدَہٗ ۙ﴿۲﴾	","আল্লাযী জামা‘আ মা-লাওঁ‘ওয়া ‘আদ্দাদাহ।","	২) যে অর্থ জমায় এবং তা গুণে গুণে রাখে৷	",2	),
    QuranAyatModels(	104,"	یَحۡسَبُ اَنَّ مَالَہٗۤ اَخۡلَدَہٗ ۚ﴿۳﴾	","ইয়াহছাবুআন্না মা-লাহূআখলাদাহ।","	৩) সে মনে করে তার অর্থ -সম্পদ চিরকাল থাকবে ৷	",3	),
    QuranAyatModels(	104,"	کَلَّا لَیُنۡۢبَذَنَّ فِی الۡحُطَمَۃِ ۫﴿ۖ۴﴾	","কাল্লা-লাইউমবাযান্না ফিল হুতামাহ।","	৪) কখনো নয়, তাকে তো চূর্ণ - বিচূর্ণকারী জায়গায় ফেলে দেয়া হবে৷	",4	),
    QuranAyatModels(	104,"	وَ مَاۤ اَدۡرٰىکَ مَا الۡحُطَمَۃُ ؕ﴿۵﴾	","ওয়ামাআদরা-কা মাল হুতামাহ।","	৫) আর তুমি কি জানো সেই চূর্ণ - বিচূর্ণকারী জায়গাটি কি ?	",5	),
    QuranAyatModels(	104,"	نَارُ اللّٰہِ الۡمُوۡقَدَۃُ ۙ﴿۶﴾	","না-রুল্লা-হিল মূকাদাহ","	৬) আল্লাহর আগুন ,  প্রচণ্ডভাবে উৎক্ষিপ্ত , 	",6	),
    QuranAyatModels(	104,"	الَّتِیۡ تَطَّلِعُ عَلَی الۡاَفۡـِٕدَۃِ ؕ﴿۷﴾	","আল্লাতী তাত্তালি‘উ আলাল আফইদাহ।","	৭) যা হৃদয় অভ্যন্তরে পৌঁছে যাবে ৷	",7	),
    QuranAyatModels(	104,"	اِنَّہَا عَلَیۡہِمۡ مُّؤۡصَدَۃٌ ۙ﴿۸﴾	","ইন্নাহা-‘আলাইহিম মু’সাদাহ","	৮) তা তাদের ওপর ঢেকে দিয়ে বন্ধ করা হবে	",8	),
    QuranAyatModels(	104,"	فِیۡ عَمَدٍ مُّمَدَّدَۃٍ ٪﴿۹﴾	","ফী ‘আমাদিম মুমাদ্দাদাহ ।","	৯) (এমন অবস্থায় যে তা ) উঁচু উঁচু থামে (ঘেরাও হয়ে থাকবো )৷	",9	),

  QuranAyatModels(	87,"	 بِسۡمِ اللّٰہِ الرَّحۡمٰنِ الرَّحِیۡمِ ﴿۱﴾ 	","বিছমিল্লাহির রাহমানির রাহিম।","	শুরু করছি আল্লাহর নামে যিনি পরম করুণাময়, অতি দয়ালু।	",0	),
  QuranAyatModels(	87,"	سَبِّحِ اسۡمَ رَبِّکَ الۡاَعۡلَی ۙ﴿۱﴾	","ছাব্বিহিছমা রাব্বিকাল আ‘লা-।","	১) ( হে নবী ) তোমার সুমহান রবের নামরে তাসবীহ পাঠ করো৷	",1	),
  QuranAyatModels(	87,"	الَّذِیۡ خَلَقَ فَسَوّٰی ۪ۙ﴿۲﴾	","আল্লাযী খালাকা ফাছওওয়া-।","	২) যিনি সৃষ্টি করেছেন এবং সমতা কায়েম করেছেন৷ 	",2	),
  QuranAyatModels(	87,"	وَ الَّذِیۡ قَدَّرَ فَہَدٰی ۪ۙ﴿۳﴾	","ওয়াল্লাযী কাদ্দারা ফাহাদা-।","	৩) যিনি তাকদীর গড়েছেন তারপর পথ দেখিয়েছেন৷	",3	),
  QuranAyatModels(	87,"	وَ الَّذِیۡۤ اَخۡرَجَ الۡمَرۡعٰی ۪ۙ﴿۴﴾	","ওয়াল্লাযীআখরাজাল মার‘আ-।","	৪) যিনি উদ্ভিদ উৎপন্ন করেছেন৷	",4	),
  QuranAyatModels(	87,"	فَجَعَلَہٗ غُثَآءً اَحۡوٰی ؕ﴿۵﴾	","ফাজা‘আলাহূগুছাআন আহওয়া-।","	৫) তারপর তাদেরকে কালো আবর্জনায় পরিণত করেছেন৷	",5	),
  QuranAyatModels(	87,"	سَنُقۡرِئُکَ فَلَا تَنۡسٰۤی ۙ﴿۶﴾	","ছানুকরিউকা ফালা-তানছা-।","	৬) আমি তোমাকে পড়িয়ে দেবো , তারপর তুমি আর ভুলবে না৷	",6	),
  QuranAyatModels(	87,"	اِلَّا مَا شَآءَ اللّٰہُ ؕ اِنَّہٗ یَعۡلَمُ الۡجَہۡرَ وَ مَا یَخۡفٰی ؕ﴿۷﴾	","ইল্লা-মা-শাআল্লা-হু ইন্নাহূইয়া‘লামুল জাহরা ওয়ামা-ইয়াখফা-।","	৭) তবে আল্লাহ যা চান তা ছাড়া ৷ তিনি জানেন প্রকাশ্য এবং যা কিছু গোপন আছে তাও৷	",7	),
  QuranAyatModels(	87,"	وَ نُیَسِّرُکَ لِلۡیُسۡرٰی ۚ﴿ۖ۸﴾	","ওয়া নুইয়াছছিরুকা লিল ইউছরা-।","	৮) আর আমি তোমাকে সহজ পথের সুযোগ সুবিধা দিচ্ছি৷  	",8	),
  QuranAyatModels(	87,"	فَذَکِّرۡ اِنۡ نَّفَعَتِ الذِّکۡرٰی ؕ﴿۹﴾	","ফাযাক্কির ইন নাফা‘আতিযযিকরা-।","	৯) কাজেই তুমি উপদেশ দাও , যদি উপদেশ উপকারী হয়	",9	),
  QuranAyatModels(	87,"	سَیَذَّکَّرُ مَنۡ یَّخۡشٰی ﴿ۙ۱۰﴾	","ছাইয়াযযাক্কারু মাইঁ ইয়াখশা-।","	১০) যে ভয় করে সে উপদেশ গ্রহণ করে নেবে৷	",10	),
  QuranAyatModels(	87,"	وَ یَتَجَنَّبُہَا الۡاَشۡقَی ﴿ۙ۱۱﴾	","ওয়া ইয়াতাজান্নাবুহাল আশকা-।","১১) আর তার প্রতি অবহেলা করবে নিতান্ত দুর্ভাগাই",11	),
  QuranAyatModels(	87,"	الَّذِیۡ یَصۡلَی النَّارَ الۡکُبۡرٰی ﴿ۚ۱۲﴾	","আল্লাযী ইয়াসলান্না-রাল কুবরা-।","১২) যে বৃহৎ আগুনে প্রবেশ করবে ",12	),
  QuranAyatModels(	87,"	ثُمَّ لَا یَمُوۡتُ فِیۡہَا وَ لَا یَحۡیٰی ﴿ؕ۱۳﴾	","ছু ম্মা লা-ইয়ামূতুফীহা-ওয়ালা-ইয়াহইয়া-।","	১৩) তারপর সেখানে মরবেও না, বাঁচবেও না ৷	",13	),
  QuranAyatModels(	87,"	قَدۡ اَفۡلَحَ مَنۡ تَزَکّٰی ﴿ۙ۱۴﴾	","কাদ আফলাহা মান তাঝাকা-।","	১৪) সে সফলকাম হয়েছে , যে পবিত্রতা অবলম্বন করেছে	",14	),
  QuranAyatModels(	87,"	وَ ذَکَرَ اسۡمَ رَبِّہٖ فَصَلّٰی ﴿ؕ۱۵﴾	","ওয়া যাকারাছমা রাব্বিহী ফাসাল্লা-।","	১৫) এবং নিজের রবের নাম স্মরণ করেছে তারপর নামায পড়েছে ৷ 	",15	),
  QuranAyatModels(	87,"	بَلۡ تُؤۡثِرُوۡنَ الۡحَیٰوۃَ الدُّنۡیَا ﴿۫ۖ۱۶﴾	","বাল তু’ছিরূনাল হায়া-তাদ্দুনইয়া-।","	১৬) কিন্তু তোমরা দুনিয়ার জীবনকে প্রাধান্য দিয়ে থাকো৷	",16	),
  QuranAyatModels(	87,"	وَ الۡاٰخِرَۃُ خَیۡرٌ وَّ اَبۡقٰی ﴿ؕ۱۷﴾	","ওয়াল আ-খিরাতুখাইরুওঁ ওয়া আবকা-।","	১৭) অথচ আখেরাত উৎকৃষ্ট ও স্থায়ী৷	",17	),
  QuranAyatModels(	87,"	اِنَّ ہٰذَا لَفِی الصُّحُفِ الۡاُوۡلٰی ﴿ۙ۱۸﴾	","ইন্না হা-যা-লাফিসসুহুফিল উলা-।","	১৮) পূর্বে অবতীর্ণ সহীফাগুলোয় একথাই বলা হয়েছিল , 	",18	),
  QuranAyatModels(	87,"	صُحُفِ اِبۡرٰہِیۡمَ وَ مُوۡسٰی ﴿٪۱۹﴾	","সুহুফি ইবরা-হীমা ওয়া মূছা।","	১৯) ইবরাহীম ও মূসার সহীফায়৷	",19	),


  ];

  List<QuranAyatModels> get getSurahumajah=>_quranAyatModels;

}